Polish README for submission
